reduce.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>(reduce)</title>
<meta name="generator" content="Org Mode" />
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
<link rel="apple-touch-icon" sizes="180x180" href="./apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="./favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="./favicon-16x16.png">
<meta property="og:title" content="(reduce)">
<meta property="og:description" content="">
<meta property="og:image" content="https://notes.neeasade.net/assets/img/backgrounds/newfeather.png">
<meta property="og:url" content="https://neeasade.net/">
<meta property="description" content="">
<meta name="twitter:card" content="summary">
<link rel='stylesheet' href='/assets/css/colors.css?sum=495589c982e6b68f1a8adabc54e44dda'>
<link rel='stylesheet' href='./assets/css/colors.css?sum=495589c982e6b68f1a8adabc54e44dda'>
<link rel='stylesheet' href='/assets/css/normalize.css?sum=112272e51c80ffe5bd01becd2ce7d656'>
<link rel='stylesheet' href='./assets/css/normalize.css?sum=112272e51c80ffe5bd01becd2ce7d656'>
<link rel='stylesheet' href='/assets/css/magick.css?sum=e67dc754cb3ed386e2529c61f1b67ed6'>
<link rel='stylesheet' href='./assets/css/magick.css?sum=e67dc754cb3ed386e2529c61f1b67ed6'>
<link rel='stylesheet' href='/assets/css/notes.css?sum=42de97b824d20d34f0c5351b59dc1c2a'>
<link rel='stylesheet' href='./assets/css/notes.css?sum=42de97b824d20d34f0c5351b59dc1c2a'>
</head>
<body>
<main id="content" class="content">
<header>
<div style="float: left">
    <a href='./index.html'>../notes</a>
</div>

<div style="float: right">
    
    <a href="https://raw.githubusercontent.com/neeasade/neeasade.github.io/source/posts/2020-11-04-reduce.org">source</a>
</div>
<h1 class=title>
    <svg viewBox="0 0 40 40" xmlns="http://www.w3.org/2000/svg">
        <rect x="5" y="15" width="20" height="20" fill="none" stroke="#5a5a5a" stroke-width="2"/>
        <rect x="14" y="6" width="20" height="20" fill="none" stroke="#5a5a5a" stroke-width="2"/>
    </svg>
    (reduce)
    <svg viewBox="0 0 40 40" xmlns="http://www.w3.org/2000/svg">
        <rect x="5" y="15" width="20" height="20" fill="none" stroke="#5a5a5a" stroke-width="2"/>
        <rect x="14" y="6" width="20" height="20" fill="none" stroke="#5a5a5a" stroke-width="2"/>
    </svg>
</h1>
<div class="org-center">
<p>

</p>
</div>
<span class=pubinfo>
    Published 2020-11-04
</span>
<div class="posttags"> <a href='./tag-clojure.html'>#clojure</a> </div>
</header>
<hr>
<p>
One habit I had to initially overcome coming to Clojure was a tendency to loop recur all the time instead of reducing. Here&rsquo;s a snippet from #clojure where I came to ask about the habit that I saved from that time:
</p>

<hr>

<p>
<b>neeasade</b> hello all &#x2013; newbie clojure user here, and I&rsquo;ve noticed I tend to solve almost all my problems with loop+recur forms.
just wondering if that&rsquo;s like, maybe a sign I&rsquo;m still doing stuff procedurally.
</p>

<p>
<b>justin_smith</b> neeasade: yeah - for example any time you do (recur (rest x)) is a sign you are doing it the hard way.
clojure has many functions to abstract variants of that pattern (traversing a collection in order) without needing to explicitly do a procedural loop.
then it&rsquo;s a question of learning what the various collection functions are useful for (filter, map, mapcat, reduce, for etc.).
</p>

<p>
<b>neeasade</b> I guess the problem I have is I feel like usually I have a collection of &rsquo;moves&rsquo; or &rsquo;ops&rsquo; that I want to apply to &rsquo;state&rsquo; and have state change along the way.
</p>

<p>
<b>justin_smith</b> that sounds like reduce or reductions to me.
</p>

<p>
<b>neeasade</b> maybe reduce is what I need to get comfy with then (I&rsquo;m comf with map/reduce/filter).
</p>

<p>
<b>justin_smith</b> it caries a state (usually called an &ldquo;accumulator&rdquo; but it can be anything) between each step.
</p>

<p>
<b>neeasade</b> cool &#x2013; thanks, I&rsquo;ve use reducing/reducers before, I think I just fell out of habit because it doesn&rsquo;t feel &ldquo;natural&rdquo; to me yet.
</p>

<p>
<b>justin_smith</b>:
</p>
<div class="org-src-container">
<pre class="src src-clojure">(reduce
 (fn [acc i]
   (let [res (+ acc i)]
     (if (&gt; res 100) (reduced res) res)))
 0 (range))
;; =&gt; 105
</pre>
</div>

<p>
<b>justin_smith</b> neeasade: also reduce has a built in debugger, you can s/reduce/reductions/.
</p>
<div class="org-src-container">
<pre class="src src-clojure">(reductions
 (fn [acc i]
   (let [res (+ acc i)]
     (if (&gt; res 100) (reduced res) res)))
 0 (range))
;; =&gt; (0 0 1 3 6 ...)
</pre>
</div>

<p>
<b>neeasade</b> thanks justin_smith &#x2013; appreciate it!
</p>

<div class=separator> ∗ ∗ ∗ </div>

<p>
Now, let&rsquo;s compare what this difference looks like with easy-ranked <a href="http://www.4clojure.com/problem/40">4clojure problem</a>:
</p>

<p>
Write a function which separates the items of a sequence by an arbitrary value.
</p>

<div class="org-src-container">
<pre class="src src-clojure">;; replace the '__'
(= (__ 0 [1 2 3]) [1 0 2 0 3])
(= (apply str (__ ", " ["one" "two" "three"])) "one, two, three")
(= (__ :z [:a :b :c :d]) [:a :z :b :z :c :z :d])
</pre>
</div>

<p>
Before (bad habits):
</p>

<div class="org-src-container">
<pre class="src src-clojure">(fn [sep coll &amp; state]
   (if (= 1 (count coll))
     (conj state (first coll))
     (recur sep (rest coll)
            (conj (or state [])
                  (first coll)
                  sep))))
</pre>
</div>

<p>
We&rsquo;re doing a lot of manual management of state here, to carry it through the solution.
</p>

<p>
After:
</p>

<div class="org-src-container">
<pre class="src src-clojure">(fn [sep coll]
   (butlast
    (reduce (fn [state next]
              (conj state next sep))
            [] coll)))
</pre>
</div>

<p>
Just gotta remember to embrace reducin&rsquo;, and the implicit carrying of state it gives us.
</p>

<div class="org-center">
<p>
<a href="https://clojuredocs.org/clojure.core/reduce">(reduce)</a>
</p>
</div>

<footer>
    <div style="float: left">
         <a href='my-shell-prompt.html'>newer: my shell prompt</a> 
    </div>
    <div style="text-align: right">
         <a href='annoying-org-typing-slowdowns.html'>older: annoying org typing slowdowns</a> 
    </div>
</footer>
<hr>
</main>
</body>
</html>
